In [1]:
import pandas as pd

In [16]:
data = pd.read_csv("Books.csv")
df = pd.DataFrame(data)

In [17]:
df.head()

,Title,Price,Stocks,Tax,UPC
0,A Light in the Attic,Â£51.77,22 available,Â£0.00,a897fe39b1053632
1,Tipping the Velvet,Â£53.74,20 available,Â£0.00,90fa61229261140a
2,Soumission,Â£50.10,20 available,Â£0.00,6957f44c3847a760
3,Sharp Objects,Â£47.82,20 available,Â£0.00,e00eb4fd7b871a48
4,Sapiens: A Brief History of Humankind,Â£54.23,20 available,Â£0.00,4165285e1663650f

In [18]:
df.describe()

                         Title    Price       Stocks     Tax               UPC
count                     1000     1000         1000    1000              1000
unique                     999      903           21       1              1000
top     The Star-Touched Queen  Â£44.18  3 available  Â£0.00  a897fe39b1053632
freq                         2        3          196    1000                 1

In [21]:
df.isnull().sum()

Title     0
Price     0
Stocks    0
Tax       0
UPC       0
dtype: int64

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Title   1000 non-null   object
 1   Price   1000 non-null   object
 2   Stocks  1000 non-null   object
 3   Tax     1000 non-null   object
 4   UPC     1000 non-null   object
dtypes: object(5)
memory usage: 39.2+ KB